Revit 2027 API
DirectShapeReferenceOptions(DirectShapeReferenceOptions) Constructor
 Constructs a new copy of the input DirectShapeRefOptions object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DirectShapeReferenceOptions(
	DirectShapeReferenceOptions other
)
Public Sub New (
	other As DirectShapeReferenceOptions
)
public:
DirectShapeReferenceOptions(
	DirectShapeReferenceOptions^ other
)
new :
        other : DirectShapeReferenceOptions -> DirectShapeReferenceOptions
Parameters
other DirectShapeReferenceOptions
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeReferenceOptions Class
DirectShapeReferenceOptions Overload
Autodesk.Revit.DB Namespace